Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པ་དེ་ལྟ་བུའི་སྨོན་ལམ་གྱི་ཁྱད་པར་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ལ་ཡང་མེད་དོ། །
en: Because Mañjuśrī Kumāra­bhūta has a special prayer for the accomplishment of that conduct, which a hundred thousand quintillion bodhisattvas do not have.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ནི་ཚད་མེད་དོ། །
en: Mañjuśrī Kumāra­bhūta has accomplished countless prayers.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་ཁྱད་པར་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་ནི་ཚད་མེད་དོ། །
en: Mañjuśrī Kumāra­bhūta has accomplished countless special bodhisattva qualities.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ཡུམ་ལྟ་བུའོ། །
en: Mañjuśrī Kumāra­bhūta is like a mother for a hundred thousand quintillion buddhas.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ལ་གདམས་ངག་སྟོན་པའོ། །
en: Mañjuśrī Kumāra­bhūta teaches instructions to a hundred thousand quintillion bodhisattvas.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་།
en: Mañjuśrī Kumāra­bhūta is dedicated to ripening and guiding all realms of beings.

source: གདུལ་བ་ལ་རབ་ཏུ་བརྩོན་པའོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་མྱིང་གི་འཁོར་ལོས་རྣམ་པར་རྒྱས་པར་གྱུར་པའོ། །
en: Mañjuśrī Kumāra­bhūta has spread the wheel of his name throughout the world realms of the ten directions.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་གཏམ་གྱི་སྐྱེས་བུར་གྱུར་པའོ། །
en: Mañjuśrī Kumāra­bhūta is a person who has spoken to all the assembled followers of the tathāgatas.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བསྔགས་ཤིང་བསྟོད་པའོ། །
en: Mañjuśrī Kumāra­bhūta is extolled and praised by all the tathāgatas.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་སྟེ་ཆོས་ཟབ་མོའི་ཡེ་ཤེས་ལ་རྣམ་པར་སྤྱོད་པའོ། །
en: Mañjuśrī Kumāra­bhūta sees all phenomena exactly as they are and practices the wisdom of the profound Dharma.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་རྣམ་པར་ཐར་བ་ཐམས་ཅད་ཀྱི་ཚུལ་ཐམས་ཅད་ལ་རིང་དུ་སོང་བའི་སྤྱོད་ཡུལ་དང་ལྡན་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན་ཏུ་བཟང་པོ་ལ་ཞུགས་པའོ། །རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་དེ་ནི་ཁྱོད་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་སྐྱེད་པའོ། །
en: Mañjuśrī Kumāra­bhūta has the scope of conduct that has gone far in the ways of all liberations and follows the completely good bodhisattva conduct.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་འཕེལ་བར་བྱེད་པའོ། །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་མང་པོ་རབ་ཏུ་སྒྲུབ་པའོ། །ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་སྟོན་པའོ། །ཡོན་ཏན་ཐམས་ཅད་ལ་ཡང་དག་པར་སྐུལ་བའོ། །སྨོན་ལམ་ཆེན་པོའི་དྲ་བ་ཐམས་ཅད་དུ་འཇུག་པའོ། །སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ཐམས་ཅད་ལ་རབ་ཏུ་གཞོག་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གསང་བ་ཐོས་པར་བྱེད་པའོ། །
en: “Noble one, that kalyāṇamitra is the one who has given birth to you into the family of the tathāgatas; he is the one who has increased your roots of merit; he is the one who has caused you to look for bodhisattva accumulations; he is the one who has revealed the kalyāṇamitras to you; he is the one who has inspired you toward all qualities; he is the one who caused you to enter the net of great prayers; he is the one who has established you in the accomplishment of prayers; he is the one who caused you to hear the secrets of all the bodhisattvas; he is the one who has taught you all the inconceivabilities of the bodhisattvas; and he is the one who has practiced together with you in your past lives.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་གྱིས་མི་ཁྱབ་པ་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པའོ། །སྔོན་གྱི་ཚེའི་གནས་སུ་སྐལ་བ་མཐུན་པར་སྤྱད་པའོ། །རིགས་ཀྱི་བུ་དེ་བས་ན་ཁྱོད་ད་ལྟར་ཡང་འཇམ་དཔལ་གྱི་རྐང་པའི་དྲུང་ན་འདུག་གིས་ཡོན་ཏན་གྱི་གདམས་ངག་ཐམས་ཅད་ཐོབ་པར་བྱ་བ་ལ་ཡོངས་སུ་སྐྱོ་བ་མ་སྐྱེད་ཅིང་ཡོངས་སུ་སྒྱིད་ལུག་པར་མ་བྱེད་ཅིག །
en: “Therefore, noble one, be again at the feet of Mañjuśrī, and do not weary or be disheartened while receiving all the instructions for the qualities.

source: ནོར་བཟངས་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ཇི་སྙེད་ཅིག་མཐོང་བ་དང་། སྤྱོད་པའི་སྒོ་ཇི་སྙེད་ཅིག་ཐོས་པ་དང་། རྣམ་པར་ཐར་པའི་ཚུལ་ཇི་སྙེད་ཅིག་ལ་ཞུགས་པ་དང་། སྨོན་ལམ་གྱི་ཁྱད་པར་ཇི་སྙེད་ཅིག་ཁོང་དུ་ཆུད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་མཐུ་དང་བྱིན་གྱི་རླབས་སུ་བལྟ་སྟེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་ཐམས་ཅད་ལའང་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཆོག་ཐོབ་པའོ། །
en: It is because, Sudhana, you should see that all the kalyāṇamitras that you have seen, all the gateways to conduct that you have heard, however many liberations you have engaged in, and whatever specific prayers you have been immersed in are all because of the power and blessing of Mañjuśrī Kumāra­bhūta.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bodhisattva mahāsattva Maitreya, circumambulated him many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the bodhisattva Maitreya.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་བརྒྱ་རྩ་བཅུ་ཀུན་ཏུ་རྒྱུས་ཏེ། ཕྱོགས་ཀྱི་གནས་ཡིད་བདེ་བ་མངོན་དུ་འགྱུར་བ་ཞེས་བྱ་བ་ཞིག་ན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སེམས་ཤིང་རྣམ་པར་ལྟ་བས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་བ་མཐོང་བར་མོས་ཤིང་། སྨོན་ལམ་ཕྲད་པར་དགའ་བས་སྡོད་ཅིང་འདུག་འདུག་པ་དང་།
en: Mañjuśrī Chapter 55 Sudhana, the head merchant’s son, after passing through a hundred and ten towns, came to the district called Sumanāmukha, where, while thinking of and looking for Mañjuśrī Kumāra­bhūta, he was aspiring and praying to see Mañjuśrī Kumāra­bhūta and continually yearning to meet him.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། དཔག་ཚད་བརྒྱ་རྩ་བཅུའི་ཕ་རོལ་ནས་ལག་པ་བརྐྱང་སྟེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་ཡིད་བདེ་བ་མངོན་དུ་འགྱུར་བ་ན་འདུག་པའི་སྤྱི་བོར་བཞག་སྟེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: Then Mañjuśrī Kumāra­bhūta, from a distance of a hundred and ten yojanas, extended his hand and placed it upon the head of Sudhana, the head merchant’s son, who was in the town of Sumanāmukha, and said, “Well done, well done, noble one!

source: དད་པའི་དབང་པོ་དང་མྱི་ལྡན་པ་སེམས་སྐྱོ་བ་ཅན་བསམ་པ་ཞུམ་པ་ཅན་སྦྱོར་བ་བོར་བ་བརྩོན་འགྲུས་ལྡོག་པ། ཡོན་ཏན་ཅུང་ཟད་ཀྱིས་དགའ་བར་རྩི་བ། དགེ་བའི་རྩ་བ་གཅིག་ལ་ཞེན་པར་གནས་པ། སྤྱོད་པ་དང་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ལ་མྱི་མཁས་པ་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་བཟུང་བ། སངས་རྒྱས་ཀྱིས་མ་དགོངས་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཉིད་འདི་ལྟ་བུ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་དང་ཚུལ་འདི་ལྟ་བུ་དང་། སྤྱོད་ཡུལ་འདི་ལྟ་བུ་དང་། གནས་འདི་ལྟ་བུ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་འམ། རྣམ་པར་ཤེས་པར་བྱ་བ་འམ། ཁོང་དུ་ཆུད་པར་བྱ་བ་འམ། འཇུག་པར་བྱ་བ་འམ། ཡིད་ཆེས་པར་བྱ་བ་འམ། བརྟག་པར་བྱ་བའམ། རྟོགས་པར་བྱ་བའམ། ཐོབ་པར་བྱ་བར་མྱི་ནུས་སོ། །
en: Someone who does not have the power of faith, who has a mind that wearies, who has thoughts of despondency, who abandons practice, who turns away from diligence, who is pleased by having a few qualities, who remains clinging to a single root of merit, who is not skilled in accomplishing the conduct and prayer, who is not in the care of a kalyāṇamitra, and who does not consider the buddhas is unable to know the true nature of phenomena in this way, or to know this kind of way and this kind of range of activity, or to know this kind of place or enter it, or to believe in it or examine it or understand it or attain it.”

source: ཞེས་ཏེ་དེས་དེ་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན་པ་དང་། ཡང་དག་པར་བསྐུལ་པ་དང་། གཟེངས་བསྟོད་པ་དང་དགའ་བར་བྱས་ཏེ་ཆོས་ཀྱི་སྒོ་གྲངས་མྱེད་པ་དང་། ལྡན་པར་བྱས་ནས་ཡེ་ཤེས་མཐའ་ཡས་པའི་སྣང་བ་ཆེན་པོ་ཐོབ་པར་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་དང་།
en: Then Mañjuśrī Kumāra­bhūta taught Sudhana by speaking of the Dharma and, having inspired him, extolled him, and gladdened him, made him the possessor of countless Dharma gateways, so that he attained the great illumination of infinite wisdom.

source: སྤོབས་པ་དང་ཏིང་ངེ་འཛིན་དང་། མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་མཐའ་ཡས་པའི་བྱིན་གྱིས་བྱིན་དུ་བརླབས་པར་བྱས་ཏེ། ཀུན་ཏུ་བཟང་པའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ལ་བཞག་ནས་བདག་གི་ཡུལ་ལའང་རབ་ཏུ་བཞག་སྟེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་དྲུང་ནས་སོང་ངོ་། ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ལས་སྡོང་པོས་བརྒྱན་པའི་ལེའུ་སྟེ། བཞི་བཅུ་རྩ་ལྔ་པའོ།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་ཉི་ཤུ་གཉིས་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བསྙེན་བཀུར་བ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཚོགས་བསགས་པའི་སེམས་དང་ལྡན་པ། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་ལ་མཐུན་པར་འཛིན་པས་ཞུགས་པ། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་དྲུང་དུ་བསམ་པ་མཉམ་པར་འགྲོ་བ། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དགའ་བར་བྱ་བས་ཡིད་མི་འབྱུང་བའི་བློ་དང་ལྡན་པ།
en: He blessed him with a bodhisattva’s retention, eloquence, samādhi, higher cognitions, and infinite wisdom and established him in the field of completely good conduct, and he remained in his own region and departed from the presence of Sudhana, the head merchant’s son.

source: དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པའི་ཚུལ་རྒྱ་མཚོའི་རྗེས་སུ་སོང་བ་སྙིང་རྗེ་ཆེན་པོའི་བསམ་པ་རྒྱ་མཚོ་ལས་ཡང་དག་པར་བྱུང་བའི་སྙིང་པོ་དང་ལྡན་པ། བྱམས་པ་ཆེན་པོའི་ཚུལ་གྱི་སྤྲིན་གྱིས་འགྲོ་བ་ཐམས་ཅད་རྣམ་པར་སྣང་བར་བྱས་པ། དགའ་བ་ཆེན་པོའི་ཤུགས་རྣམ་པར་འཕེལ་བའི་ལུས་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་ཆེན་པོ་ལ་རབ་ཏུ་ཞི་བར་རྣམ་པར་དཔྱོད་པ་སྒོ་ཐམས་ཅད་ནས་ལྷུག་པར་འཕྲོ་བའི་གཏོང་བའི་མྱིག་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོའི་ནན་ཏན་རབ་ཏུ་རྫོགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མོས་པའི་ལམ་དུ་ཞུགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ལ་བརྩོན་འགྲུས་ཀྱི་ཤུགས་རྣམ་པར་འཕེལ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པས་ཤིན་ཏུ་སྦྱངས་པའི་བློ་དང་ལྡན་པ། དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་ཞུགས་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཁོང་དུ་ཆུད་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོའི་ཚུལ་རྒྱ་མཚོའི་རྗེས་སུ་སོང་བ། འཇིག་རྟེན་གྱི་སྐྱེ་གནས་ཐམས་ཅད་དུ་གཟུགས་བརྙན་ཡོངས་སུ་སྟོན་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་ཚུལ་རྒྱ་མཚོ་ལ་ཞུགས་པ། བསྐལ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་རབ་ཏུ་ཞུགས་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡུལ་སྣང་བ་རབ་ཏུ་ཐོབ་པ། བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བ། ཐམས་ཅད་མཁྱེན་པའི་ལམ་སྣང་བ་རབ་ཏུ་ཐོབ་པ། ཕྱོགས་ཐམས་ཅད་དུ་སྒྲིབ་པ་མེད་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་རབ་ཏུ་ཞུགས་པའི་བློ་དང་ལྡན་པ། ཞིང་གི་ཚུལ་ཐམས་ཅད་ལ་སྣང་བ་རབ་ཏུ་གྲུབ་པ་སེམས་ཅན་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་དོན་བྱ་བ་ལ་རྒྱུད་དང་མི་འཐུན་པ་མྱེད་པར་རྗེས་སུ་སོང་ངོ་། །སྒྲིབ་པའི་གཡང་སའི་རི་ཐམས་ཅད་རྣམ་པར་འཐོར་བ། སྒྲིབ་པ་མེད་པའི་ཆོས་ཉིད་ཀྱི་རྗེས་སུ་སོང་བ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སའི་གཞི་ཀུན་ཏུ་གནས་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྙིང་པོ་ཅན་ལ་རབ་ཏུ་ཞི་བར་རྣམ་པར་དཔྱོད་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་རྗེས་སུ་ཚོལ་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་དེ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་ཡུལ་ལ་རྣམ་པར་དཔྱོད་ཅིང་འདུག་པར་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོའི་མྱིང་ཐོས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐོས་པ་དང་། སྨོན་ལམ་གྱི་ཁྱད་པར་ཐོས་པ་དང་ཚོགས་ཡོངས་སུ་བསྒྲུབ་པ་ལ་འཇུག་པ་དང་གནས་པའི་ཁྱད་པར་ཐོས་པ་དང་། མངོན་པར་བསྒྲུབ་པ་དང་འབྱུང་བའི་ལམ་གྱི་ཁྱད་པར་ཐོས་པ་དང་། ཀུན་ཏུ་བཟང་པོའི་སའི་ཚུལ་གྱི་རྒྱུད་ཐོས་པ་དང་། སའི་ཚོགས་ཐོས་པ་དང་ས་ཐོབ་པར་བྱེད་པའི་ཤུགས་ཐོས་པ་དང་ས་ཡོངས་སུ་གནོན་པ་ཐོས་པ་དང་། ས་ལ་གནས་པ་ཐོས་པ་དང་། ས་སྔོན་དུ་འདོར་བས་རྣམ་པར་གནོན་པ་ཐོས་པ་དང་། སའི་སྤྱོད་ཡུལ་ཐོས་པ་དང་། སའི་བྱིན་གྱི་རླབས་ཐོས་པ་དང་ས་ལ་ཡང་དག་པར་གནས་པ་ཐོས་ནས། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་དགའ་ཞིང་སྐོམ་སྟེ། ནམ་མཁའི་དབྱིངས་ལྟར་ཤིན་ཏུ་ཡངས་པའི་སེམས་མངོན་པར་ཞེན་པ་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པ་དང་། ཞིང་གི་འདུ་ཤེས་ཤིན་ཏུ་བསྒོམས་པ་དང་། ཆགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་སེམས་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་སྤྱོད་ཡུལ་ཅན་དང་། ཐོགས་པ་མྱེད་པའི་སེམས་ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་དང་། སྒྲིབ་པ་མེད་པའི་སེམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡུལ་ཡོངས་སུ་གནོན་པ་དང་། ཤིན་ཏུ་རྣམ་པར་དག་པའི་སེམས་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་ལྷག་མཐོང་གིས་ཡོངས་སུ་དག་པ་དང་། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་སེམས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་རྒྱ་མཚོ་ལ་ཞུགས་པ་དང་། ཤིན་ཏུ་ཡངས་པའི་སེམས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་རྒྱས་པར་འགེངས་པ་དང་ཤིན་ཏུ་ཕྱེ་བའི་སེམས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱེད་པ་དང་། ཚད་མེད་པའི་སེམས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་གཟུགས་བརྙན་རབ་ཏུ་འབྱུང་བ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པས་མྱི་ཟད་ཅིང་མཐར་ཐུག་པ་མེད་པའི་སེམས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྟོབས་དང་མི་བསྙེངས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་མཐར་ཐུག་པས་སྙིང་པོ་བྱང་ཆུབ་རྡོ་རྗེ་དམ་པའི་སྙིང་པོ་ཅན་དེ་ལ་པད་མོའི་སྟན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ལྷུན་ཅན་ཞིག་ལ་དེ་བཞིན་གཤེགས་པའི་གདན་སེང་གེའི་ཁྲི་ལ་མངོན་པར་བལྟས་ཏེ་འདུག་གོ །
en: Samanta­bhadra and “The Prayer for Completely Good Conduct” Chapter 56 Sudhana, the head merchant’s son, who had reverenced as many kalyāṇamitras as there are atoms in the world realms of a billion-world universe; who had the motivation to gather the accumulations for omniscience; who correctly held and practiced the instructions and teachings of all kalyāṇamitras; who in the presence of all kalyāṇamitras gave rise to the same aspiration as they did; who had the realization that pleased and was not displeasing to all kalyāṇamitras; who followed the ocean of the ways of the instructions and teachings of all kalyāṇamitras; who had the essence that arises from the ocean of the aspiration of great compassion; who had shone on all beings with the clouds of the ways of great love; who had a body that increased the power of great joy; who was active in complete peace within the vast bodhisattva liberations; who had the vision focused on whatever emanates from all gateways; who had perfected the practice of the ocean of the qualities of all tathāgatas; who had followed the path of aspiration of all the tathāgatas; who had increased the power of diligence in the accumulation of omniscience; who had a mind with the perfect development of the motivation and aspiration of all bodhisattvas; who had comprehended the succession of all the tathāgatas in the three times; who had realized the ocean of the ways of the Dharmas of all buddhas; who had followed the ocean of the ways of the Dharma wheels of all the tathāgatas; who had the range of activity of manifesting the appearance of taking birth in all worlds; who had comprehended the ocean of the ways of the prayers of all bodhisattvas; who was established in bodhisattva conduct in all kalpas; who had attained the illumination of the scope of omniscience; who had increased all the powers of a bodhisattva; who had attained the illumination of the path to omniscience; who had attained the unobscured illumination of all directions; who had the realization that pervades the ways of the entire realm of phenomena; who had accomplished the illumination of the ways of all realms; who had engaged in the appropriate way with the activities of the vast extent of beings; who had demolished all the precipices and mountains of obscurations; who had followed the unobscured true nature of phenomena; who was active in complete peace in the bodhisattva liberations that have the essence of all the surfaces and bases in the realm of phenomena; who was seeking the range of activity of all the tathāgatas; who had been blessed by all the tathāgatas; who was established in being active in the range of activity of a bodhisattva; who had heard the name of the bodhisattva mahāsattva Samanta­bhadra; who had heard of his bodhisattva activity; who had heard of his special prayers; who had heard of his special entry and dwelling in the accomplishment of accumulation; who had heard of his special path of accomplishment and setting forth; who had heard of his way of activity on the completely good level; who had heard of the accumulations of his level; who had heard of his power for attaining that level; who had heard of his ascending to that level; who had heard of his being established on that level; who had heard of his reaching that level through leaving the previous levels; who had heard of the range of activity of that level; who had heard of the blessings of that level; who had heard of his dwelling on that level; and who yearned and thirsted for the sight of the bodhisattva Samanta­bhadra; with a motivation as vast as space that had risen above all clinging; with a perfect meditation that perceived all realms; with a mind that had transcended all attachments; with an unobscured range of activity in all phenomena; with an obstructed mind that pervaded the entire ocean of the directions; with an unobscured mind that ascended to the scope of perception of omniscience; with a pure mind that had the pure vipaśyanā that adorns a bodhimaṇḍa; with a perfectly distinct mind that comprehended the ocean of the Dharmas of all the buddhas; with a vast mind that pervaded all realms of beings in order to ripen and guide them; with an immense mind that purified all buddha realms; with a measureless mind that manifested his appearance within the assemblies of the followers of all buddhas; and with an inexhaustible and endless mind that dwelled in all kalpas and had the conclusive strengths, fearlessnesses, and unique qualities of all the tathāgatas, Sudhana, in the bodhimaṇḍa, which had the supreme vajra as its essence, was seated upon a lotus seat that was a mass of all jewels, gazing at the lion throne that was the seat of the Tathāgata.

source: དེ་ལྟར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དེ་ལྟ་བུའི་བསམ་པ་དང་ཡིད་ལ་བྱ་བ་ལ་བརྩོན་པར་གནས་པའི་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རླན་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་དང་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་སྐལ་བ་མཐུན་པས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་འགྱུར་བར་སྔོན་གྱི་ལྟས་བཅུ་བྱུང་ངོ་། །
en: Sudhana, the head merchant’s son, who was dedicated to that kind of aspiration and attention, was saturated by previous roots of merit, was blessed by the tathāgatas, and had the equivalent roots of merit in the past as the bodhisattva Samanta­bhadra, and therefore there appeared ten omens of the appearance of the bodhisattva Samanta­bhadra.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་རྣམ་པར་དག་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་མི་ཁོམ་པ་དང་། ངན་སོང་དང་ངན་འགྲོའི་ལམ་ཐམས་ཅད་རྣམ་པར་བསྩལ་བས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །
en: What were those ten?

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་པད་མོའི་ཚལ་གྱི་རྒྱན་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་སེམས་དགའ་ཞིང་སིམ་པར་བྱེད་པས། རྣམ་པར་དག་པར་གྱུར་ཏོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རང་བཞིན་དུ་ཀུན་ཏུ་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སེམས་ཅན་གྱི་ཁམས་ཀུན་ཏུ་མཚན་དང་དཔེ་བྱད་བཟང་པོས་རབ་ཏུ་བརྒྱན་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱན་དང་ལྷབ་ལྷུབ་ཀྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁེབས་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཕན་ཚུན་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་། གནོད་སེམས་མེད་པའི་སེམས་དང་ལྡན་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱ་བ་ལ་བརྩོན་པར་ཀུན་ནས་གནས་པས་རྣམ་པར་དག་པར་གྱུར་ཏེ།
en: They were that (1) all buddha realms were purified through having pure adornments at the bodhimaṇḍas of all tathāgatas; (2) all buddha realms were purified through the elimination of all their unfortunate states, lower existences, and lower realms; (3) all buddha realms were purified through becoming pure buddha realms with arrays of lotus beds; (4) all buddha realms were purified through the bodies and minds of all their beings becoming joyous and happy; (5) all buddha realms were purified through becoming made of all precious materials; (6) all buddha realms were purified through all their realms of beings becoming adorned by the signs and features of a great being; (7) all buddha realms were purified through being covered by clouds of adornments and decorations; (8) all buddha realms were purified through all their beings having a nature that was mutually loving, altruistic, and without malice; (9) all buddha realms were purified through their bodhimaṇḍas becoming adorned by adornments; and (10) all buddha realms were purified through all their beings becoming dedicated to remembering and focusing on the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་འགྱུར་བའི། སྔོན་གྱི་ལྟས་བཅུ་པོ་དེ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: Those were the ten omens of the appearance of the bodhisattva mahāsattva Samanta­bhadra.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་འགྱུར་བའི་སྔོན་གྱི་ལྟས་སྣང་བ་ཆེན་པོ་བཅུ་བྱུང་བར་གྱུར་ཏེ།
en: There also appeared ten lights that were omens of the appearance of the bodhisattva Samanta­bhadra.

source: བཅུ་གང་ཞེ་ན་འདི་ལྟ་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ཞིང་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་དྲ་བ་མང་པོ་རྣམ་པར་སྣང་བར་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་མང་པོ་འཐོན་ཏེ། ཁ་དོག་གཅིག་པ་དང་ཁ་དོག་སྣ་ཚོགས་དང་ཁ་དོག་བརྒྱ་སྟོང་དུ་མར་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྤྲིན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པར་བྱེད་པ་མང་པོ་འཐོན་ཏེ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བའི་འཁོར་ལོ་དང་དཀྱིལ་འཁོར་གྱི་སྤྲིན་མང་པོ་འཐོན་ཏེ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཀྱང་སྤོས་དང་།
en: What were those ten?
